<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Project 2: Forest Fire Prediction

Forest Fire is one of the common disasters in today’s world. Forest Fire damages our ecosystem. Forest fire is also a severe enemy of animals.
So, you can build a Forest fire prediction system using k-means clustering. Forest fire prediction system identifies major fire hotspots and their severity.
You can also use meteorological data for finding the common seasons for wildfires and various weather conditions to increase your model’s accuracy.

In [1]:
import pandas as pd
import numpy as np
import math
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.pylab as pylab
from scipy import stats

# Cause plots to be displayed in the notebook:
%pylab inline
%matplotlib inline

Populating the interactive namespace from numpy and matplotlib

In [5]:
#Reading the file
#First 5 rows of data
data = pd.read_csv("amazon.csv")
data.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01

In [9]:
data.columns

Index(['year', 'state', 'month', 'number', 'date'], dtype='object')

In [11]:
data.describe()

              year       number
count  6454.000000  6454.000000
mean   2007.461729   108.293163
std       5.746654   190.812242
min    1998.000000     0.000000
25%    2002.000000     3.000000
50%    2007.000000    24.000000
75%    2012.000000   113.000000
max    2017.000000   998.000000

In [13]:
data.corr()

            year    number
year    1.000000  0.065201
number  0.065201  1.000000